Revit 2024 API
FunctionId Methods
The FunctionId type exposes the following members.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetObjectData
Retrieves data needed to serialize the target object.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FunctionId Class
Autodesk.Revit.Exceptions Namespace